nguyenthangphong/STM32/stm32f4xx_driver/Drivers/Inc/stm32f411xe_rcc_driver.h
#ifndef INC_STM32F411XE_RCC_DRIVER_H_
#define INC_STM32F411XE_RCC_DRIVER_H_

#include "stm32f411xe.h"
#include "stm32f411xe_gpio_driver.h"
#include "stm32f411xe_def.h"

#define RCC_HSI_CLOCK                           (0x00F42400U)                   /* !< 16000000 MHz */
#define RCC_HSE_CLOCK                           (0x007A1200U)                   /* !< 8000000 MHz */

/* Oscillator Type */
#define RCC_OSCILLATORTYPE_NONE                 (0x00000000U)
#define RCC_OSCILLATORTYPE_HSE                  (0x00000001U)
#define RCC_OSCILLATORTYPE_HSI                  (0x00000002U)
#define RCC_OSCILLATORTYPE_LSE                  (0x00000004U)
#define RCC_OSCILLATORTYPE_LSI                  (0x00000008U)

/* Clock Type */
#define RCC_CLOCKTYPE_SYSCLK                    (0x00000001U)
#define RCC_CLOCKTYPE_HCLK                      (0x00000002U)
#define RCC_CLOCKTYPE_PCLK1                     (0x00000004U)
#define RCC_CLOCKTYPE_PCLK2                     (0x00000008U)

/* System Clock Source */
#define RCC_SYSCLKSOURCE_HSI                    RCC_CFGR_SW_HSI
#define RCC_SYSCLKSOURCE_HSE                    RCC_CFGR_SW_HSE
#define RCC_SYSCLKSOURCE_PLLCLK                 RCC_CFGR_SW_PLL

/* HSE Config */
#define RCC_HSE_OFF                             (0x00000000U)                       /*!< HSE oscillator OFF */
#define RCC_HSE_ON                              (0x00000001U)                       /*!< HSE oscillator ON */
#define RCC_HSE_BYPASS                          (RCC_CR_HSEON | RCC_CR_HSEBYP)      /*!< HSE oscillator bypassed with an external clock */

/* HSI Config */
#define RCC_HSI_OFF                             (0x00000000U)                       /*!< HSI oscillator OFF */
#define RCC_HSI_ON                              (0x00000001U)                       /*!< HSI oscillator ON */

/* HSICALIBRATION  */
#define RCC_HSITRIM_0                          (0x00000000U)                        /*!< HSITRIM = 0 */
#define RCC_HSITRIM_1                          (0x00000001U)                        /*!< HSITRIM = 1 */
#define RCC_HSITRIM_2                          (0x00000002U)                        /*!< HSITRIM = 2 */
#define RCC_HSITRIM_3                          (0x00000003U)                        /*!< HSITRIM = 3 */
#define RCC_HSITRIM_4                          (0x00000004U)                        /*!< HSITRIM = 4 */
#define RCC_HSITRIM_5                          (0x00000005U)                        /*!< HSITRIM = 5 */
#define RCC_HSITRIM_6                          (0x00000006U)                        /*!< HSITRIM = 6 */
#define RCC_HSITRIM_7                          (0x00000007U)                        /*!< HSITRIM = 7 */
#define RCC_HSITRIM_8                          (0x00000008U)                        /*!< HSITRIM = 8 */
#define RCC_HSITRIM_9                          (0x00000009U)                        /*!< HSITRIM = 9 */
#define RCC_HSITRIM_10                         (0x0000000AU)                        /*!< HSITRIM = 10 */
#define RCC_HSITRIM_11                         (0x0000000BU)                        /*!< HSITRIM = 11 */
#define RCC_HSITRIM_12                         (0x0000000CU)                        /*!< HSITRIM = 12 */
#define RCC_HSITRIM_13                         (0x0000000DU)                        /*!< HSITRIM = 13 */
#define RCC_HSITRIM_14                         (0x0000000EU)                        /*!< HSITRIM = 14 */
#define RCC_HSITRIM_15                         (0x0000000FU)                        /*!< HSITRIM = 15 */
#define RCC_HSITRIM_16                         (0x00000010U)                        /*!< HSITRIM = 16 */
#define RCC_HSITRIM_17                         (0x00000011U)                        /*!< HSITRIM = 17 */
#define RCC_HSITRIM_18                         (0x00000012U)                        /*!< HSITRIM = 18 */
#define RCC_HSITRIM_19                         (0x00000013U)                        /*!< HSITRIM = 19 */
#define RCC_HSITRIM_20                         (0x00000014U)                        /*!< HSITRIM = 20 */
#define RCC_HSITRIM_21                         (0x00000015U)                        /*!< HSITRIM = 21 */
#define RCC_HSITRIM_22                         (0x00000016U)                        /*!< HSITRIM = 22 */
#define RCC_HSITRIM_23                         (0x00000017U)                        /*!< HSITRIM = 23 */
#define RCC_HSITRIM_24                         (0x00000018U)                        /*!< HSITRIM = 24 */
#define RCC_HSITRIM_25                         (0x00000019U)                        /*!< HSITRIM = 25 */
#define RCC_HSITRIM_26                         (0x0000001AU)                        /*!< HSITRIM = 26 */
#define RCC_HSITRIM_27                         (0x0000001BU)                        /*!< HSITRIM = 27 */
#define RCC_HSITRIM_28                         (0x0000001CU)                        /*!< HSITRIM = 28 */
#define RCC_HSITRIM_29                         (0x0000001DU)                        /*!< HSITRIM = 29 */
#define RCC_HSITRIM_30                         (0x0000001EU)                        /*!< HSITRIM = 30 */
#define RCC_HSITRIM_31                         (0x0000001FU)                        /*!< HSITRIM = 31 */

/* LSE Config */
#define RCC_LSE_OFF                             (0x00000000U)                       /*!< LSE oscillator OFF */
#define RCC_LSE_ON                              (0x00000001U)                       /*!< LSE oscillator ON */
#define RCC_LSE_BYPASS                          (RCC_BDCR_LSEON | RCC_BDCR_LSEBYP)  /*!< LSE oscillator bypassed with an external clock */

/* LSI Config */
#define RCC_LSI_OFF                             (0x00000000U)                       /*!< LSI oscillator OFF */
#define RCC_LSI_ON                              (0x00000001U)                       /*!< LSI oscillator ON */

/* PLL Config */
#define RCC_PLL_NONE                            (0x00000000U)                       /*!< PLL None */
#define RCC_PLL_OFF                             (0x00000001U)                       /*!< PLL OFF */
#define RCC_PLL_ON                              (0x00000002U)                       /*!< PLL ON */

/* AHB Clock Divider */
#define RCC_AHB_PRESCALER_1                     RCC_CFGR_HPRE_DIV_1
#define RCC_AHB_PRESCALER_2                     RCC_CFGR_HPRE_DIV_2
#define RCC_AHB_PRESCALER_4                     RCC_CFGR_HPRE_DIV_4
#define RCC_AHB_PRESCALER_8                     RCC_CFGR_HPRE_DIV_8
#define RCC_AHB_PRESCALER_16                    RCC_CFGR_HPRE_DIV_16
#define RCC_AHB_PRESCALER_64                    RCC_CFGR_HPRE_DIV_64
#define RCC_AHB_PRESCALER_128                   RCC_CFGR_HPRE_DIV_128
#define RCC_AHB_PRESCALER_256                   RCC_CFGR_HPRE_DIV_256
#define RCC_AHB_PRESCALER_512                   RCC_CFGR_HPRE_DIV_512

/* APB1 Clock Divider */
#define RCC_APB1_PRESCALER_1                    RCC_CFGR_PPRE1_DIV_1
#define RCC_APB1_PRESCALER_2                    RCC_CFGR_PPRE1_DIV_2
#define RCC_APB1_PRESCALER_4                    RCC_CFGR_PPRE1_DIV_4
#define RCC_APB1_PRESCALER_8                    RCC_CFGR_PPRE1_DIV_8
#define RCC_APB1_PRESCALER_16                   RCC_CFGR_PPRE1_DIV_16

/* APB2 Clock Divider */
#define RCC_APB2_PRESCALER_1                    RCC_CFGR_PPRE2_DIV_1
#define RCC_APB2_PRESCALER_2                    RCC_CFGR_PPRE2_DIV_2
#define RCC_APB2_PRESCALER_4                    RCC_CFGR_PPRE2_DIV_4
#define RCC_APB2_PRESCALER_8                    RCC_CFGR_PPRE2_DIV_8
#define RCC_APB2_PRESCALER_16                   RCC_CFGR_PPRE2_DIV_16

/* Division factor for the main PLL (PLL) input clock */
#define RCC_PLLM_DIV_2                          (0x00000002U)                       /*!< PLLM = 2 */
#define RCC_PLLM_DIV_3                          (0x00000003U)                       /*!< PLLM = 3 */
#define RCC_PLLM_DIV_4                          (0x00000004U)                       /*!< PLLM = 4 */
#define RCC_PLLM_DIV_5                          (0x00000005U)                       /*!< PLLM = 5 */
#define RCC_PLLM_DIV_6                          (0x00000006U)                       /*!< PLLM = 6 */
#define RCC_PLLM_DIV_7                          (0x00000007U)                       /*!< PLLM = 7 */
#define RCC_PLLM_DIV_8                          (0x00000008U)                       /*!< PLLM = 8 */
#define RCC_PLLM_DIV_9                          (0x00000009U)                       /*!< PLLM = 9 */
#define RCC_PLLM_DIV_10                         (0x0000000AU)                       /*!< PLLM = 10 */
#define RCC_PLLM_DIV_11                         (0x0000000BU)                       /*!< PLLM = 11 */
#define RCC_PLLM_DIV_12                         (0x0000000CU)                       /*!< PLLM = 12 */
#define RCC_PLLM_DIV_13                         (0x0000000DU)                       /*!< PLLM = 13 */
#define RCC_PLLM_DIV_14                         (0x0000000EU)                       /*!< PLLM = 14 */
#define RCC_PLLM_DIV_15                         (0x0000000FU)                       /*!< PLLM = 15 */
#define RCC_PLLM_DIV_16                         (0x00000010U)                       /*!< PLLM = 16 */
#define RCC_PLLM_DIV_17                         (0x00000011U)                       /*!< PLLM = 17 */
#define RCC_PLLM_DIV_18                         (0x00000012U)                       /*!< PLLM = 18 */
#define RCC_PLLM_DIV_19                         (0x00000013U)                       /*!< PLLM = 19 */
#define RCC_PLLM_DIV_20                         (0x00000014U)                       /*!< PLLM = 20 */
#define RCC_PLLM_DIV_21                         (0x00000015U)                       /*!< PLLM = 21 */
#define RCC_PLLM_DIV_22                         (0x00000016U)                       /*!< PLLM = 22 */
#define RCC_PLLM_DIV_23                         (0x00000017U)                       /*!< PLLM = 23 */
#define RCC_PLLM_DIV_24                         (0x00000018U)                       /*!< PLLM = 24 */
#define RCC_PLLM_DIV_25                         (0x00000019U)                       /*!< PLLM = 25 */
#define RCC_PLLM_DIV_26                         (0x0000001AU)                       /*!< PLLM = 26 */
#define RCC_PLLM_DIV_27                         (0x0000001BU)                       /*!< PLLM = 27 */
#define RCC_PLLM_DIV_28                         (0x0000001CU)                       /*!< PLLM = 28 */
#define RCC_PLLM_DIV_29                         (0x0000001DU)                       /*!< PLLM = 29 */
#define RCC_PLLM_DIV_30                         (0x0000001EU)                       /*!< PLLM = 30 */
#define RCC_PLLM_DIV_31                         (0x0000001FU)                       /*!< PLLM = 31 */
#define RCC_PLLM_DIV_32                         (0x00000020U)                       /*!< PLLM = 32 */
#define RCC_PLLM_DIV_33                         (0x00000021U)                       /*!< PLLM = 33 */
#define RCC_PLLM_DIV_34                         (0x00000022U)                       /*!< PLLM = 34 */
#define RCC_PLLM_DIV_35                         (0x00000023U)                       /*!< PLLM = 35 */
#define RCC_PLLM_DIV_36                         (0x00000024U)                       /*!< PLLM = 36 */
#define RCC_PLLM_DIV_37                         (0x00000025U)                       /*!< PLLM = 37 */
#define RCC_PLLM_DIV_38                         (0x00000026U)                       /*!< PLLM = 38 */
#define RCC_PLLM_DIV_39                         (0x00000027U)                       /*!< PLLM = 39 */
#define RCC_PLLM_DIV_40                         (0x00000028U)                       /*!< PLLM = 40 */
#define RCC_PLLM_DIV_41                         (0x00000029U)                       /*!< PLLM = 41 */
#define RCC_PLLM_DIV_42                         (0x0000002AU)                       /*!< PLLM = 42 */
#define RCC_PLLM_DIV_43                         (0x0000002BU)                       /*!< PLLM = 43 */
#define RCC_PLLM_DIV_44                         (0x0000002CU)                       /*!< PLLM = 44 */
#define RCC_PLLM_DIV_45                         (0x0000002DU)                       /*!< PLLM = 45 */
#define RCC_PLLM_DIV_46                         (0x0000002EU)                       /*!< PLLM = 46 */
#define RCC_PLLM_DIV_47                         (0x0000002FU)                       /*!< PLLM = 47 */
#define RCC_PLLM_DIV_48                         (0x00000030U)                       /*!< PLLM = 48 */
#define RCC_PLLM_DIV_49                         (0x00000031U)                       /*!< PLLM = 49 */
#define RCC_PLLM_DIV_50                         (0x00000032U)                       /*!< PLLM = 50 */
#define RCC_PLLM_DIV_51                         (0x00000033U)                       /*!< PLLM = 51 */
#define RCC_PLLM_DIV_52                         (0x00000034U)                       /*!< PLLM = 52 */
#define RCC_PLLM_DIV_53                         (0x00000035U)                       /*!< PLLM = 53 */
#define RCC_PLLM_DIV_54                         (0x00000036U)                       /*!< PLLM = 54 */
#define RCC_PLLM_DIV_55                         (0x00000037U)                       /*!< PLLM = 55 */
#define RCC_PLLM_DIV_56                         (0x00000038U)                       /*!< PLLM = 56 */
#define RCC_PLLM_DIV_57                         (0x00000039U)                       /*!< PLLM = 57 */
#define RCC_PLLM_DIV_58                         (0x0000003AU)                       /*!< PLLM = 58 */
#define RCC_PLLM_DIV_59                         (0x0000003BU)                       /*!< PLLM = 59 */
#define RCC_PLLM_DIV_60                         (0x0000003CU)                       /*!< PLLM = 60 */
#define RCC_PLLM_DIV_61                         (0x0000003DU)                       /*!< PLLM = 61 */
#define RCC_PLLM_DIV_62                         (0x0000003EU)                       /*!< PLLM = 62 */
#define RCC_PLLM_DIV_63                         (0x0000003FU)                       /*!< PLLM = 63 */

