nguyenthangphong/STM32/stm32f4xx_driver/Drivers/Inc/stm32f411xe_rcc_driver.h
/* Main PLL (PLL) multiplication factor for VCO */
#define RCC_PLLN_MUL_50                         (0x00000032U)                       /*!< PLLN = 50 */
#define RCC_PLLN_MUL_51                         (0x00000033U)                       /*!< PLLN = 51 */
#define RCC_PLLN_MUL_52                         (0x00000034U)                       /*!< PLLN = 52 */
#define RCC_PLLN_MUL_53                         (0x00000035U)                       /*!< PLLN = 53 */
#define RCC_PLLN_MUL_54                         (0x00000036U)                       /*!< PLLN = 54 */
#define RCC_PLLN_MUL_55                         (0x00000037U)                       /*!< PLLN = 55 */
#define RCC_PLLN_MUL_56                         (0x00000038U)                       /*!< PLLN = 56 */
#define RCC_PLLN_MUL_57                         (0x00000039U)                       /*!< PLLN = 57 */
#define RCC_PLLN_MUL_58                         (0x0000003AU)                       /*!< PLLN = 58 */
#define RCC_PLLN_MUL_59                         (0x0000003BU)                       /*!< PLLN = 59 */
#define RCC_PLLN_MUL_60                         (0x0000003CU)                       /*!< PLLN = 60 */
#define RCC_PLLN_MUL_61                         (0x0000003DU)                       /*!< PLLN = 61 */
#define RCC_PLLN_MUL_62                         (0x0000003EU)                       /*!< PLLN = 62 */
#define RCC_PLLN_MUL_63                         (0x0000003FU)                       /*!< PLLN = 63 */
#define RCC_PLLN_MUL_64                         (0x00000040U)                       /*!< PLLN = 64 */
#define RCC_PLLN_MUL_65                         (0x00000041U)                       /*!< PLLN = 65 */
#define RCC_PLLN_MUL_66                         (0x00000042U)                       /*!< PLLN = 66 */
#define RCC_PLLN_MUL_67                         (0x00000043U)                       /*!< PLLN = 67 */
#define RCC_PLLN_MUL_68                         (0x00000044U)                       /*!< PLLN = 68 */
#define RCC_PLLN_MUL_69                         (0x00000045U)                       /*!< PLLN = 69 */
#define RCC_PLLN_MUL_70                         (0x00000046U)                       /*!< PLLN = 70 */
#define RCC_PLLN_MUL_71                         (0x00000047U)                       /*!< PLLN = 71 */
#define RCC_PLLN_MUL_72                         (0x00000048U)                       /*!< PLLN = 72 */
#define RCC_PLLN_MUL_73                         (0x00000049U)                       /*!< PLLN = 73 */
#define RCC_PLLN_MUL_74                         (0x0000004AU)                       /*!< PLLN = 74 */
#define RCC_PLLN_MUL_75                         (0x0000004BU)                       /*!< PLLN = 75 */
#define RCC_PLLN_MUL_76                         (0x0000004CU)                       /*!< PLLN = 76 */
#define RCC_PLLN_MUL_77                         (0x0000004DU)                       /*!< PLLN = 77 */
#define RCC_PLLN_MUL_78                         (0x0000004EU)                       /*!< PLLN = 78 */
#define RCC_PLLN_MUL_79                         (0x0000004FU)                       /*!< PLLN = 79 */
#define RCC_PLLN_MUL_80                         (0x00000050U)                       /*!< PLLN = 80 */
#define RCC_PLLN_MUL_81                         (0x00000051U)                       /*!< PLLN = 81 */
#define RCC_PLLN_MUL_82                         (0x00000052U)                       /*!< PLLN = 82 */
#define RCC_PLLN_MUL_83                         (0x00000053U)                       /*!< PLLN = 83 */
#define RCC_PLLN_MUL_84                         (0x00000054U)                       /*!< PLLN = 84 */
#define RCC_PLLN_MUL_85                         (0x00000055U)                       /*!< PLLN = 85 */
#define RCC_PLLN_MUL_86                         (0x00000056U)                       /*!< PLLN = 86 */
#define RCC_PLLN_MUL_87                         (0x00000057U)                       /*!< PLLN = 87 */
#define RCC_PLLN_MUL_88                         (0x00000058U)                       /*!< PLLN = 88 */
#define RCC_PLLN_MUL_89                         (0x00000059U)                       /*!< PLLN = 89 */
#define RCC_PLLN_MUL_90                         (0x0000005AU)                       /*!< PLLN = 90 */
#define RCC_PLLN_MUL_91                         (0x0000005BU)                       /*!< PLLN = 91 */
#define RCC_PLLN_MUL_92                         (0x0000005CU)                       /*!< PLLN = 92 */
#define RCC_PLLN_MUL_93                         (0x0000005DU)                       /*!< PLLN = 93 */
#define RCC_PLLN_MUL_94                         (0x0000005EU)                       /*!< PLLN = 94 */
#define RCC_PLLN_MUL_95                         (0x0000005FU)                       /*!< PLLN = 95 */
#define RCC_PLLN_MUL_96                         (0x00000060U)                       /*!< PLLN = 96 */
#define RCC_PLLN_MUL_97                         (0x00000061U)                       /*!< PLLN = 97 */
#define RCC_PLLN_MUL_98                         (0x00000062U)                       /*!< PLLN = 98 */
#define RCC_PLLN_MUL_99                         (0x00000063U)                       /*!< PLLN = 99 */
#define RCC_PLLN_MUL_100                        (0x00000064U)                       /*!< PLLN = 100 */
#define RCC_PLLN_MUL_101                        (0x00000065U)                       /*!< PLLN = 101 */
#define RCC_PLLN_MUL_102                        (0x00000066U)                       /*!< PLLN = 102 */
#define RCC_PLLN_MUL_103                        (0x00000067U)                       /*!< PLLN = 103 */
#define RCC_PLLN_MUL_104                        (0x00000068U)                       /*!< PLLN = 104 */
#define RCC_PLLN_MUL_105                        (0x00000069U)                       /*!< PLLN = 105 */
#define RCC_PLLN_MUL_106                        (0x0000006AU)                       /*!< PLLN = 106 */
#define RCC_PLLN_MUL_107                        (0x0000006BU)                       /*!< PLLN = 107 */
#define RCC_PLLN_MUL_108                        (0x0000006CU)                       /*!< PLLN = 108 */
#define RCC_PLLN_MUL_109                        (0x0000006DU)                       /*!< PLLN = 109 */
#define RCC_PLLN_MUL_110                        (0x0000006EU)                       /*!< PLLN = 110 */
#define RCC_PLLN_MUL_111                        (0x0000006FU)                       /*!< PLLN = 111 */
#define RCC_PLLN_MUL_112                        (0x00000070U)                       /*!< PLLN = 112 */
#define RCC_PLLN_MUL_113                        (0x00000071U)                       /*!< PLLN = 113 */
#define RCC_PLLN_MUL_114                        (0x00000072U)                       /*!< PLLN = 114 */
#define RCC_PLLN_MUL_115                        (0x00000073U)                       /*!< PLLN = 115 */
#define RCC_PLLN_MUL_116                        (0x00000074U)                       /*!< PLLN = 116 */
#define RCC_PLLN_MUL_117                        (0x00000075U)                       /*!< PLLN = 117 */
#define RCC_PLLN_MUL_118                        (0x00000076U)                       /*!< PLLN = 118 */
#define RCC_PLLN_MUL_119                        (0x00000077U)                       /*!< PLLN = 119 */
#define RCC_PLLN_MUL_120                        (0x00000078U)                       /*!< PLLN = 120 */
#define RCC_PLLN_MUL_121                        (0x00000079U)                       /*!< PLLN = 121 */
#define RCC_PLLN_MUL_122                        (0x0000007AU)                       /*!< PLLN = 122 */
#define RCC_PLLN_MUL_123                        (0x0000007BU)                       /*!< PLLN = 123 */
#define RCC_PLLN_MUL_124                        (0x0000007CU)                       /*!< PLLN = 124 */
#define RCC_PLLN_MUL_125                        (0x0000007DU)                       /*!< PLLN = 125 */
#define RCC_PLLN_MUL_126                        (0x0000007EU)                       /*!< PLLN = 126 */
#define RCC_PLLN_MUL_127                        (0x0000007FU)                       /*!< PLLN = 127 */
#define RCC_PLLN_MUL_128                        (0x00000080U)                       /*!< PLLN = 128 */
#define RCC_PLLN_MUL_129                        (0x00000081U)                       /*!< PLLN = 129 */
#define RCC_PLLN_MUL_130                        (0x00000082U)                       /*!< PLLN = 130 */
#define RCC_PLLN_MUL_131                        (0x00000083U)                       /*!< PLLN = 131 */
#define RCC_PLLN_MUL_132                        (0x00000084U)                       /*!< PLLN = 132 */
#define RCC_PLLN_MUL_133                        (0x00000085U)                       /*!< PLLN = 133 */
#define RCC_PLLN_MUL_134                        (0x00000086U)                       /*!< PLLN = 134 */
#define RCC_PLLN_MUL_135                        (0x00000087U)                       /*!< PLLN = 135 */
#define RCC_PLLN_MUL_136                        (0x00000088U)                       /*!< PLLN = 136 */
#define RCC_PLLN_MUL_137                        (0x00000089U)                       /*!< PLLN = 137 */
#define RCC_PLLN_MUL_138                        (0x0000008AU)                       /*!< PLLN = 138 */
#define RCC_PLLN_MUL_139                        (0x0000008BU)                       /*!< PLLN = 139 */
#define RCC_PLLN_MUL_140                        (0x0000008CU)                       /*!< PLLN = 140 */
#define RCC_PLLN_MUL_141                        (0x0000008DU)                       /*!< PLLN = 141 */
#define RCC_PLLN_MUL_142                        (0x0000008EU)                       /*!< PLLN = 142 */
#define RCC_PLLN_MUL_143                        (0x0000008FU)                       /*!< PLLN = 143 */
#define RCC_PLLN_MUL_144                        (0x00000090U)                       /*!< PLLN = 144 */
#define RCC_PLLN_MUL_145                        (0x00000091U)                       /*!< PLLN = 145 */
#define RCC_PLLN_MUL_146                        (0x00000092U)                       /*!< PLLN = 146 */
#define RCC_PLLN_MUL_147                        (0x00000093U)                       /*!< PLLN = 147 */
#define RCC_PLLN_MUL_148                        (0x00000094U)                       /*!< PLLN = 148 */
#define RCC_PLLN_MUL_149                        (0x00000095U)                       /*!< PLLN = 149 */
#define RCC_PLLN_MUL_150                        (0x00000096U)                       /*!< PLLN = 150 */
#define RCC_PLLN_MUL_151                        (0x00000097U)                       /*!< PLLN = 151 */
#define RCC_PLLN_MUL_152                        (0x00000098U)                       /*!< PLLN = 152 */
#define RCC_PLLN_MUL_153                        (0x00000099U)                       /*!< PLLN = 153 */
#define RCC_PLLN_MUL_154                        (0x0000009AU)                       /*!< PLLN = 154 */
#define RCC_PLLN_MUL_155                        (0x0000009BU)                       /*!< PLLN = 155 */
#define RCC_PLLN_MUL_156                        (0x0000009CU)                       /*!< PLLN = 156 */
#define RCC_PLLN_MUL_157                        (0x0000009DU)                       /*!< PLLN = 157 */
#define RCC_PLLN_MUL_158                        (0x0000009EU)                       /*!< PLLN = 158 */
#define RCC_PLLN_MUL_159                        (0x0000009FU)                       /*!< PLLN = 159 */
#define RCC_PLLN_MUL_160                        (0x000000A0U)                       /*!< PLLN = 160 */
#define RCC_PLLN_MUL_161                        (0x000000A1U)                       /*!< PLLN = 161 */
#define RCC_PLLN_MUL_162                        (0x000000A2U)                       /*!< PLLN = 162 */
#define RCC_PLLN_MUL_163                        (0x000000A3U)                       /*!< PLLN = 163 */
#define RCC_PLLN_MUL_164                        (0x000000A4U)                       /*!< PLLN = 164 */
#define RCC_PLLN_MUL_165                        (0x000000A5U)                       /*!< PLLN = 165 */
#define RCC_PLLN_MUL_166                        (0x000000A6U)                       /*!< PLLN = 166 */
#define RCC_PLLN_MUL_167                        (0x000000A7U)                       /*!< PLLN = 167 */
#define RCC_PLLN_MUL_168                        (0x000000A8U)                       /*!< PLLN = 168 */
#define RCC_PLLN_MUL_169                        (0x000000A9U)                       /*!< PLLN = 169 */
#define RCC_PLLN_MUL_170                        (0x000000AAU)                       /*!< PLLN = 170 */
#define RCC_PLLN_MUL_171                        (0x000000ABU)                       /*!< PLLN = 171 */
#define RCC_PLLN_MUL_172                        (0x000000ACU)                       /*!< PLLN = 172 */
#define RCC_PLLN_MUL_173                        (0x000000ADU)                       /*!< PLLN = 173 */
#define RCC_PLLN_MUL_174                        (0x000000AEU)                       /*!< PLLN = 174 */
#define RCC_PLLN_MUL_175                        (0x000000AFU)                       /*!< PLLN = 175 */
#define RCC_PLLN_MUL_176                        (0x000000B0U)                       /*!< PLLN = 176 */
#define RCC_PLLN_MUL_177                        (0x000000B1U)                       /*!< PLLN = 177 */
#define RCC_PLLN_MUL_178                        (0x000000B2U)                       /*!< PLLN = 178 */
#define RCC_PLLN_MUL_179                        (0x000000B3U)                       /*!< PLLN = 179 */
#define RCC_PLLN_MUL_180                        (0x000000B4U)                       /*!< PLLN = 180 */
#define RCC_PLLN_MUL_181                        (0x000000B5U)                       /*!< PLLN = 181 */
#define RCC_PLLN_MUL_182                        (0x000000B6U)                       /*!< PLLN = 182 */
#define RCC_PLLN_MUL_183                        (0x000000B7U)                       /*!< PLLN = 183 */
#define RCC_PLLN_MUL_184                        (0x000000B8U)                       /*!< PLLN = 184 */
#define RCC_PLLN_MUL_185                        (0x000000B9U)                       /*!< PLLN = 185 */
#define RCC_PLLN_MUL_186                        (0x000000BAU)                       /*!< PLLN = 186 */
#define RCC_PLLN_MUL_187                        (0x000000BBU)                       /*!< PLLN = 187 */
#define RCC_PLLN_MUL_188                        (0x000000BCU)                       /*!< PLLN = 188 */
#define RCC_PLLN_MUL_189                        (0x000000BDU)                       /*!< PLLN = 189 */
#define RCC_PLLN_MUL_190                        (0x000000BEU)                       /*!< PLLN = 190 */
#define RCC_PLLN_MUL_191                        (0x000000BFU)                       /*!< PLLN = 191 */
#define RCC_PLLN_MUL_192                        (0x000000C0U)                       /*!< PLLN = 192 */
#define RCC_PLLN_MUL_193                        (0x000000C1U)                       /*!< PLLN = 193 */
#define RCC_PLLN_MUL_194                        (0x000000C2U)                       /*!< PLLN = 194 */
#define RCC_PLLN_MUL_195                        (0x000000C3U)                       /*!< PLLN = 195 */
#define RCC_PLLN_MUL_196                        (0x000000C4U)                       /*!< PLLN = 196 */
#define RCC_PLLN_MUL_197                        (0x000000C5U)                       /*!< PLLN = 197 */
#define RCC_PLLN_MUL_198                        (0x000000C6U)                       /*!< PLLN = 198 */
#define RCC_PLLN_MUL_199                        (0x000000C7U)                       /*!< PLLN = 199 */
#define RCC_PLLN_MUL_200                        (0x000000C8U)                       /*!< PLLN = 200 */
#define RCC_PLLN_MUL_201                        (0x000000C9U)                       /*!< PLLN = 201 */
#define RCC_PLLN_MUL_202                        (0x000000CAU)                       /*!< PLLN = 202 */
#define RCC_PLLN_MUL_203                        (0x000000CBU)                       /*!< PLLN = 203 */
#define RCC_PLLN_MUL_204                        (0x000000CCU)                       /*!< PLLN = 204 */
#define RCC_PLLN_MUL_205                        (0x000000CDU)                       /*!< PLLN = 205 */
#define RCC_PLLN_MUL_206                        (0x000000CEU)                       /*!< PLLN = 206 */
#define RCC_PLLN_MUL_207                        (0x000000CFU)                       /*!< PLLN = 207 */
#define RCC_PLLN_MUL_208                        (0x000000D0U)                       /*!< PLLN = 208 */
#define RCC_PLLN_MUL_209                        (0x000000D1U)                       /*!< PLLN = 209 */
#define RCC_PLLN_MUL_210                        (0x000000D2U)                       /*!< PLLN = 210 */
#define RCC_PLLN_MUL_211                        (0x000000D3U)                       /*!< PLLN = 211 */
#define RCC_PLLN_MUL_212                        (0x000000D4U)                       /*!< PLLN = 212 */
#define RCC_PLLN_MUL_213                        (0x000000D5U)                       /*!< PLLN = 213 */
#define RCC_PLLN_MUL_214                        (0x000000D6U)                       /*!< PLLN = 214 */
#define RCC_PLLN_MUL_215                        (0x000000D7U)                       /*!< PLLN = 215 */
#define RCC_PLLN_MUL_216                        (0x000000D8U)                       /*!< PLLN = 216 */
#define RCC_PLLN_MUL_217                        (0x000000D9U)                       /*!< PLLN = 217 */
#define RCC_PLLN_MUL_218                        (0x000000DAU)                       /*!< PLLN = 218 */
#define RCC_PLLN_MUL_219                        (0x000000DBU)                       /*!< PLLN = 219 */
#define RCC_PLLN_MUL_220                        (0x000000DCU)                       /*!< PLLN = 220 */
#define RCC_PLLN_MUL_221                        (0x000000DDU)                       /*!< PLLN = 221 */
#define RCC_PLLN_MUL_222                        (0x000000DEU)                       /*!< PLLN = 222 */
#define RCC_PLLN_MUL_223                        (0x000000DFU)                       /*!< PLLN = 223 */
#define RCC_PLLN_MUL_224                        (0x000000E0U)                       /*!< PLLN = 224 */
#define RCC_PLLN_MUL_225                        (0x000000E1U)                       /*!< PLLN = 225 */
#define RCC_PLLN_MUL_226                        (0x000000E2U)                       /*!< PLLN = 226 */
#define RCC_PLLN_MUL_227                        (0x000000E3U)                       /*!< PLLN = 227 */
#define RCC_PLLN_MUL_228                        (0x000000E4U)                       /*!< PLLN = 228 */
#define RCC_PLLN_MUL_229                        (0x000000E5U)                       /*!< PLLN = 229 */
#define RCC_PLLN_MUL_230                        (0x000000E6U)                       /*!< PLLN = 230 */
#define RCC_PLLN_MUL_231                        (0x000000E7U)                       /*!< PLLN = 231 */
#define RCC_PLLN_MUL_232                        (0x000000E8U)                       /*!< PLLN = 232 */
#define RCC_PLLN_MUL_233                        (0x000000E9U)                       /*!< PLLN = 233 */
#define RCC_PLLN_MUL_234                        (0x000000EAU)                       /*!< PLLN = 234 */
#define RCC_PLLN_MUL_235                        (0x000000EBU)                       /*!< PLLN = 235 */
#define RCC_PLLN_MUL_236                        (0x000000ECU)                       /*!< PLLN = 236 */
#define RCC_PLLN_MUL_237                        (0x000000EDU)                       /*!< PLLN = 237 */
#define RCC_PLLN_MUL_238                        (0x000000EEU)                       /*!< PLLN = 238 */
#define RCC_PLLN_MUL_239                        (0x000000EFU)                       /*!< PLLN = 239 */
#define RCC_PLLN_MUL_240                        (0x000000F0U)                       /*!< PLLN = 240 */
#define RCC_PLLN_MUL_241                        (0x000000F1U)                       /*!< PLLN = 241 */
#define RCC_PLLN_MUL_242                        (0x000000F2U)                       /*!< PLLN = 242 */
#define RCC_PLLN_MUL_243                        (0x000000F3U)                       /*!< PLLN = 243 */
#define RCC_PLLN_MUL_244                        (0x000000F4U)                       /*!< PLLN = 244 */
#define RCC_PLLN_MUL_245                        (0x000000F5U)                       /*!< PLLN = 245 */
#define RCC_PLLN_MUL_246                        (0x000000F6U)                       /*!< PLLN = 246 */
#define RCC_PLLN_MUL_247                        (0x000000F7U)                       /*!< PLLN = 247 */
#define RCC_PLLN_MUL_248                        (0x000000F8U)                       /*!< PLLN = 248 */
#define RCC_PLLN_MUL_249                        (0x000000F9U)                       /*!< PLLN = 249 */
#define RCC_PLLN_MUL_250                        (0x000000FAU)                       /*!< PLLN = 250 */
#define RCC_PLLN_MUL_251                        (0x000000FBU)                       /*!< PLLN = 251 */
#define RCC_PLLN_MUL_252                        (0x000000FCU)                       /*!< PLLN = 252 */
#define RCC_PLLN_MUL_253                        (0x000000FDU)                       /*!< PLLN = 253 */
#define RCC_PLLN_MUL_254                        (0x000000FEU)                       /*!< PLLN = 254 */
#define RCC_PLLN_MUL_255                        (0x000000FFU)                       /*!< PLLN = 255 */
#define RCC_PLLN_MUL_256                        (0x00000100U)                       /*!< PLLN = 256 */
#define RCC_PLLN_MUL_257                        (0x00000101U)                       /*!< PLLN = 257 */
#define RCC_PLLN_MUL_258                        (0x00000102U)                       /*!< PLLN = 258 */
#define RCC_PLLN_MUL_259                        (0x00000103U)                       /*!< PLLN = 259 */
#define RCC_PLLN_MUL_260                        (0x00000104U)                       /*!< PLLN = 260 */
#define RCC_PLLN_MUL_261                        (0x00000105U)                       /*!< PLLN = 261 */
#define RCC_PLLN_MUL_262                        (0x00000106U)                       /*!< PLLN = 262 */
#define RCC_PLLN_MUL_263                        (0x00000107U)                       /*!< PLLN = 263 */
#define RCC_PLLN_MUL_264                        (0x00000108U)                       /*!< PLLN = 264 */
#define RCC_PLLN_MUL_265                        (0x00000109U)                       /*!< PLLN = 265 */
#define RCC_PLLN_MUL_266                        (0x0000010AU)                       /*!< PLLN = 266 */
#define RCC_PLLN_MUL_267                        (0x0000010BU)                       /*!< PLLN = 267 */
#define RCC_PLLN_MUL_268                        (0x0000010CU)                       /*!< PLLN = 268 */
#define RCC_PLLN_MUL_269                        (0x0000010DU)                       /*!< PLLN = 269 */
#define RCC_PLLN_MUL_270                        (0x0000010EU)                       /*!< PLLN = 270 */
#define RCC_PLLN_MUL_271                        (0x0000010FU)                       /*!< PLLN = 271 */
#define RCC_PLLN_MUL_272                        (0x00000110U)                       /*!< PLLN = 272 */
#define RCC_PLLN_MUL_273                        (0x00000111U)                       /*!< PLLN = 273 */
#define RCC_PLLN_MUL_274                        (0x00000112U)                       /*!< PLLN = 274 */
#define RCC_PLLN_MUL_275                        (0x00000113U)                       /*!< PLLN = 275 */
#define RCC_PLLN_MUL_276                        (0x00000114U)                       /*!< PLLN = 276 */
#define RCC_PLLN_MUL_277                        (0x00000115U)                       /*!< PLLN = 277 */
#define RCC_PLLN_MUL_278                        (0x00000116U)                       /*!< PLLN = 278 */
#define RCC_PLLN_MUL_279                        (0x00000117U)                       /*!< PLLN = 279 */
#define RCC_PLLN_MUL_280                        (0x00000118U)                       /*!< PLLN = 280 */
#define RCC_PLLN_MUL_281                        (0x00000119U)                       /*!< PLLN = 281 */
#define RCC_PLLN_MUL_282                        (0x0000011AU)                       /*!< PLLN = 282 */
