nguyenthangphong/STM32/stm32f4xx_driver/Drivers/Inc/stm32f411xe_rcc_driver.h
#define RCC_PLLN_MUL_283                        (0x0000011BU)                       /*!< PLLN = 283 */
#define RCC_PLLN_MUL_284                        (0x0000011CU)                       /*!< PLLN = 284 */
#define RCC_PLLN_MUL_285                        (0x0000011DU)                       /*!< PLLN = 285 */
#define RCC_PLLN_MUL_286                        (0x0000011EU)                       /*!< PLLN = 286 */
#define RCC_PLLN_MUL_287                        (0x0000011FU)                       /*!< PLLN = 287 */
#define RCC_PLLN_MUL_288                        (0x00000120U)                       /*!< PLLN = 288 */
#define RCC_PLLN_MUL_289                        (0x00000121U)                       /*!< PLLN = 289 */
#define RCC_PLLN_MUL_290                        (0x00000122U)                       /*!< PLLN = 290 */
#define RCC_PLLN_MUL_291                        (0x00000123U)                       /*!< PLLN = 291 */
#define RCC_PLLN_MUL_292                        (0x00000124U)                       /*!< PLLN = 292 */
#define RCC_PLLN_MUL_293                        (0x00000125U)                       /*!< PLLN = 293 */
#define RCC_PLLN_MUL_294                        (0x00000126U)                       /*!< PLLN = 294 */
#define RCC_PLLN_MUL_295                        (0x00000127U)                       /*!< PLLN = 295 */
#define RCC_PLLN_MUL_296                        (0x00000128U)                       /*!< PLLN = 296 */
#define RCC_PLLN_MUL_297                        (0x00000129U)                       /*!< PLLN = 297 */
#define RCC_PLLN_MUL_298                        (0x0000012AU)                       /*!< PLLN = 298 */
#define RCC_PLLN_MUL_299                        (0x0000012BU)                       /*!< PLLN = 299 */
#define RCC_PLLN_MUL_300                        (0x0000012CU)                       /*!< PLLN = 300 */
#define RCC_PLLN_MUL_301                        (0x0000012DU)                       /*!< PLLN = 301 */
#define RCC_PLLN_MUL_302                        (0x0000012EU)                       /*!< PLLN = 302 */
#define RCC_PLLN_MUL_303                        (0x0000012FU)                       /*!< PLLN = 303 */
#define RCC_PLLN_MUL_304                        (0x00000130U)                       /*!< PLLN = 304 */
#define RCC_PLLN_MUL_305                        (0x00000131U)                       /*!< PLLN = 305 */
#define RCC_PLLN_MUL_306                        (0x00000132U)                       /*!< PLLN = 306 */
#define RCC_PLLN_MUL_307                        (0x00000133U)                       /*!< PLLN = 307 */
#define RCC_PLLN_MUL_308                        (0x00000134U)                       /*!< PLLN = 308 */
#define RCC_PLLN_MUL_309                        (0x00000135U)                       /*!< PLLN = 309 */
#define RCC_PLLN_MUL_310                        (0x00000136U)                       /*!< PLLN = 310 */
#define RCC_PLLN_MUL_311                        (0x00000137U)                       /*!< PLLN = 311 */
#define RCC_PLLN_MUL_312                        (0x00000138U)                       /*!< PLLN = 312 */
#define RCC_PLLN_MUL_313                        (0x00000139U)                       /*!< PLLN = 313 */
#define RCC_PLLN_MUL_314                        (0x0000013AU)                       /*!< PLLN = 314 */
#define RCC_PLLN_MUL_315                        (0x0000013BU)                       /*!< PLLN = 315 */
#define RCC_PLLN_MUL_316                        (0x0000013CU)                       /*!< PLLN = 316 */
#define RCC_PLLN_MUL_317                        (0x0000013DU)                       /*!< PLLN = 317 */
#define RCC_PLLN_MUL_318                        (0x0000013EU)                       /*!< PLLN = 318 */
#define RCC_PLLN_MUL_319                        (0x0000013FU)                       /*!< PLLN = 319 */
#define RCC_PLLN_MUL_320                        (0x00000140U)                       /*!< PLLN = 320 */
#define RCC_PLLN_MUL_321                        (0x00000141U)                       /*!< PLLN = 321 */
#define RCC_PLLN_MUL_322                        (0x00000142U)                       /*!< PLLN = 322 */
#define RCC_PLLN_MUL_323                        (0x00000143U)                       /*!< PLLN = 323 */
#define RCC_PLLN_MUL_324                        (0x00000144U)                       /*!< PLLN = 324 */
#define RCC_PLLN_MUL_325                        (0x00000145U)                       /*!< PLLN = 325 */
#define RCC_PLLN_MUL_326                        (0x00000146U)                       /*!< PLLN = 326 */
#define RCC_PLLN_MUL_327                        (0x00000147U)                       /*!< PLLN = 327 */
#define RCC_PLLN_MUL_328                        (0x00000148U)                       /*!< PLLN = 328 */
#define RCC_PLLN_MUL_329                        (0x00000149U)                       /*!< PLLN = 329 */
#define RCC_PLLN_MUL_330                        (0x0000014AU)                       /*!< PLLN = 330 */
#define RCC_PLLN_MUL_331                        (0x0000014BU)                       /*!< PLLN = 331 */
#define RCC_PLLN_MUL_332                        (0x0000014CU)                       /*!< PLLN = 332 */
#define RCC_PLLN_MUL_333                        (0x0000014DU)                       /*!< PLLN = 333 */
#define RCC_PLLN_MUL_334                        (0x0000014EU)                       /*!< PLLN = 334 */
#define RCC_PLLN_MUL_335                        (0x0000014FU)                       /*!< PLLN = 335 */
#define RCC_PLLN_MUL_336                        (0x00000150U)                       /*!< PLLN = 336 */
#define RCC_PLLN_MUL_337                        (0x00000151U)                       /*!< PLLN = 337 */
#define RCC_PLLN_MUL_338                        (0x00000152U)                       /*!< PLLN = 338 */
#define RCC_PLLN_MUL_339                        (0x00000153U)                       /*!< PLLN = 339 */
#define RCC_PLLN_MUL_340                        (0x00000154U)                       /*!< PLLN = 340 */
#define RCC_PLLN_MUL_341                        (0x00000155U)                       /*!< PLLN = 341 */
#define RCC_PLLN_MUL_342                        (0x00000156U)                       /*!< PLLN = 342 */
#define RCC_PLLN_MUL_343                        (0x00000157U)                       /*!< PLLN = 343 */
#define RCC_PLLN_MUL_344                        (0x00000158U)                       /*!< PLLN = 344 */
#define RCC_PLLN_MUL_345                        (0x00000159U)                       /*!< PLLN = 345 */
#define RCC_PLLN_MUL_346                        (0x0000015AU)                       /*!< PLLN = 346 */
#define RCC_PLLN_MUL_347                        (0x0000015BU)                       /*!< PLLN = 347 */
#define RCC_PLLN_MUL_348                        (0x0000015CU)                       /*!< PLLN = 348 */
#define RCC_PLLN_MUL_349                        (0x0000015DU)                       /*!< PLLN = 349 */
#define RCC_PLLN_MUL_350                        (0x0000015EU)                       /*!< PLLN = 350 */
#define RCC_PLLN_MUL_351                        (0x0000015FU)                       /*!< PLLN = 351 */
#define RCC_PLLN_MUL_352                        (0x00000160U)                       /*!< PLLN = 352 */
#define RCC_PLLN_MUL_353                        (0x00000161U)                       /*!< PLLN = 353 */
#define RCC_PLLN_MUL_354                        (0x00000162U)                       /*!< PLLN = 354 */
#define RCC_PLLN_MUL_355                        (0x00000163U)                       /*!< PLLN = 355 */
#define RCC_PLLN_MUL_356                        (0x00000164U)                       /*!< PLLN = 356 */
#define RCC_PLLN_MUL_357                        (0x00000165U)                       /*!< PLLN = 357 */
#define RCC_PLLN_MUL_358                        (0x00000166U)                       /*!< PLLN = 358 */
#define RCC_PLLN_MUL_359                        (0x00000167U)                       /*!< PLLN = 359 */
#define RCC_PLLN_MUL_360                        (0x00000168U)                       /*!< PLLN = 360 */
#define RCC_PLLN_MUL_361                        (0x00000169U)                       /*!< PLLN = 361 */
#define RCC_PLLN_MUL_362                        (0x0000016AU)                       /*!< PLLN = 362 */
#define RCC_PLLN_MUL_363                        (0x0000016BU)                       /*!< PLLN = 363 */
#define RCC_PLLN_MUL_364                        (0x0000016CU)                       /*!< PLLN = 364 */
#define RCC_PLLN_MUL_365                        (0x0000016DU)                       /*!< PLLN = 365 */
#define RCC_PLLN_MUL_366                        (0x0000016EU)                       /*!< PLLN = 366 */
#define RCC_PLLN_MUL_367                        (0x0000016FU)                       /*!< PLLN = 367 */
#define RCC_PLLN_MUL_368                        (0x00000170U)                       /*!< PLLN = 368 */
#define RCC_PLLN_MUL_369                        (0x00000171U)                       /*!< PLLN = 369 */
#define RCC_PLLN_MUL_370                        (0x00000172U)                       /*!< PLLN = 370 */
#define RCC_PLLN_MUL_371                        (0x00000173U)                       /*!< PLLN = 371 */
#define RCC_PLLN_MUL_372                        (0x00000174U)                       /*!< PLLN = 372 */
#define RCC_PLLN_MUL_373                        (0x00000175U)                       /*!< PLLN = 373 */
#define RCC_PLLN_MUL_374                        (0x00000176U)                       /*!< PLLN = 374 */
#define RCC_PLLN_MUL_375                        (0x00000177U)                       /*!< PLLN = 375 */
#define RCC_PLLN_MUL_376                        (0x00000178U)                       /*!< PLLN = 376 */
#define RCC_PLLN_MUL_377                        (0x00000179U)                       /*!< PLLN = 377 */
#define RCC_PLLN_MUL_378                        (0x0000017AU)                       /*!< PLLN = 378 */
#define RCC_PLLN_MUL_379                        (0x0000017BU)                       /*!< PLLN = 379 */
#define RCC_PLLN_MUL_380                        (0x0000017CU)                       /*!< PLLN = 380 */
#define RCC_PLLN_MUL_381                        (0x0000017DU)                       /*!< PLLN = 381 */
#define RCC_PLLN_MUL_382                        (0x0000017EU)                       /*!< PLLN = 382 */
#define RCC_PLLN_MUL_383                        (0x0000017FU)                       /*!< PLLN = 383 */
#define RCC_PLLN_MUL_384                        (0x00000180U)                       /*!< PLLN = 384 */
#define RCC_PLLN_MUL_385                        (0x00000181U)                       /*!< PLLN = 385 */
#define RCC_PLLN_MUL_386                        (0x00000182U)                       /*!< PLLN = 386 */
#define RCC_PLLN_MUL_387                        (0x00000183U)                       /*!< PLLN = 387 */
#define RCC_PLLN_MUL_388                        (0x00000184U)                       /*!< PLLN = 388 */
#define RCC_PLLN_MUL_389                        (0x00000185U)                       /*!< PLLN = 389 */
#define RCC_PLLN_MUL_390                        (0x00000186U)                       /*!< PLLN = 390 */
#define RCC_PLLN_MUL_391                        (0x00000187U)                       /*!< PLLN = 391 */
#define RCC_PLLN_MUL_392                        (0x00000188U)                       /*!< PLLN = 392 */
#define RCC_PLLN_MUL_393                        (0x00000189U)                       /*!< PLLN = 393 */
#define RCC_PLLN_MUL_394                        (0x0000018AU)                       /*!< PLLN = 394 */
#define RCC_PLLN_MUL_395                        (0x0000018BU)                       /*!< PLLN = 395 */
#define RCC_PLLN_MUL_396                        (0x0000018CU)                       /*!< PLLN = 396 */
#define RCC_PLLN_MUL_397                        (0x0000018DU)                       /*!< PLLN = 397 */
#define RCC_PLLN_MUL_398                        (0x0000018EU)                       /*!< PLLN = 398 */
#define RCC_PLLN_MUL_399                        (0x0000018FU)                       /*!< PLLN = 399 */
#define RCC_PLLN_MUL_400                        (0x00000190U)                       /*!< PLLN = 400 */
#define RCC_PLLN_MUL_401                        (0x00000191U)                       /*!< PLLN = 401 */
#define RCC_PLLN_MUL_402                        (0x00000192U)                       /*!< PLLN = 402 */
#define RCC_PLLN_MUL_403                        (0x00000193U)                       /*!< PLLN = 403 */
#define RCC_PLLN_MUL_404                        (0x00000194U)                       /*!< PLLN = 404 */
#define RCC_PLLN_MUL_405                        (0x00000195U)                       /*!< PLLN = 405 */
#define RCC_PLLN_MUL_406                        (0x00000196U)                       /*!< PLLN = 406 */
#define RCC_PLLN_MUL_407                        (0x00000197U)                       /*!< PLLN = 407 */
#define RCC_PLLN_MUL_408                        (0x00000198U)                       /*!< PLLN = 408 */
#define RCC_PLLN_MUL_409                        (0x00000199U)                       /*!< PLLN = 409 */
#define RCC_PLLN_MUL_410                        (0x0000019AU)                       /*!< PLLN = 410 */
#define RCC_PLLN_MUL_411                        (0x0000019BU)                       /*!< PLLN = 411 */
#define RCC_PLLN_MUL_412                        (0x0000019CU)                       /*!< PLLN = 412 */
#define RCC_PLLN_MUL_413                        (0x0000019DU)                       /*!< PLLN = 413 */
#define RCC_PLLN_MUL_414                        (0x0000019EU)                       /*!< PLLN = 414 */
#define RCC_PLLN_MUL_415                        (0x0000019FU)                       /*!< PLLN = 415 */
#define RCC_PLLN_MUL_416                        (0x000001A0U)                       /*!< PLLN = 416 */
#define RCC_PLLN_MUL_417                        (0x000001A1U)                       /*!< PLLN = 417 */
#define RCC_PLLN_MUL_418                        (0x000001A2U)                       /*!< PLLN = 418 */
#define RCC_PLLN_MUL_419                        (0x000001A3U)                       /*!< PLLN = 419 */
#define RCC_PLLN_MUL_420                        (0x000001A4U)                       /*!< PLLN = 420 */
#define RCC_PLLN_MUL_421                        (0x000001A5U)                       /*!< PLLN = 421 */
#define RCC_PLLN_MUL_422                        (0x000001A6U)                       /*!< PLLN = 422 */
#define RCC_PLLN_MUL_423                        (0x000001A7U)                       /*!< PLLN = 423 */
#define RCC_PLLN_MUL_424                        (0x000001A8U)                       /*!< PLLN = 424 */
#define RCC_PLLN_MUL_425                        (0x000001A9U)                       /*!< PLLN = 425 */
#define RCC_PLLN_MUL_426                        (0x000001AAU)                       /*!< PLLN = 426 */
#define RCC_PLLN_MUL_427                        (0x000001ABU)                       /*!< PLLN = 427 */
#define RCC_PLLN_MUL_428                        (0x000001ACU)                       /*!< PLLN = 428 */
#define RCC_PLLN_MUL_429                        (0x000001ADU)                       /*!< PLLN = 429 */
#define RCC_PLLN_MUL_430                        (0x000001AEU)                       /*!< PLLN = 430 */
#define RCC_PLLN_MUL_431                        (0x000001AFU)                       /*!< PLLN = 431 */
#define RCC_PLLN_MUL_432                        (0x000001B0U)                       /*!< PLLN = 432 */

/* Main PLL division factor for main system clock */
#define RCC_PLLP_DIV_2                          (0x00000000U)                       /*!< PLLP = 2 */
#define RCC_PLLP_DIV_4                          (0x00000001U)                       /*!< PLLP = 4 */
#define RCC_PLLP_DIV_6                          (0x00000002U)                       /*!< PLLP = 6 */
#define RCC_PLLP_DIV_8                          (0x00000003U)                       /*!< PLLP = 8 */

/* Microcontroller clock output 1 */
#define RCC_MCO1_HSI_CLOCK_SOURCE               (0x00000000U)
#define RCC_MCO1_LSE_CLOCK_SOURCE               (0x00000001U)
#define RCC_MCO1_HSE_CLOCK_SOURCE               (0x00000002U)
#define RCC_MCO1_PLL_CLOCK_SOURCE               (0x00000003U)

/* Microcontroller clock output 1 MCO1 prescaler */

